[
    {
        "year": "1892",
        "flag": "left",
        "title": "Liverpool Football Club is formed",
        "text": "Liverpool F.C. was formed on the 15th of March 1892. It was at John Houlding's house in Anfield Road that he and his closest friends  from Everton FC, formed a new club. William.E.Barclay, a great football enthusiast, strongly suggested that they should go on  a new name: Liverpool. However, it was not until 3rd June that the name Liverpool Football Club and Athletic Grounds Ltd was formally  by the Board of Trade, and the club could start to make history.\r\n"
    },
    {
        "year": "1892",
        "flag": "right",
        "title": "Reds win first ever game",
        "text": "On September 3, 1892, Higher Walton were the opposition for the club's first competitive match and the occasion was marked by an 8-0.It was the start of an excellent season for Liverpool, who easily took the Lancashire League as well as the Liverpool District Cup. With a Reserve Cup secured as well, Liverpool had claimed a modest treble - highly impressive for a team not even 12 months old. Everton were getting worried.\r\n"

    },
    {
        "year": "1893",
        "flag": "left",
        "title": "First game in Football League",
        "text": "Lengthy grass, high winds and a blinding sun were not ideal conditions for our first ever game in the Football League against hosts, themselves making their Division Two bow. What followed, however, was an exciting exhibition of football. The first half might have ended goalless but it was not without a string of Liverpool chances, with the visitors hitting the upright.\r\n"

    },
    {
        "year": "1894",
        "flag": "right",
        "title": "Promotion won at first attempt",
        "text": "Liverpool never looked back in their first season in the Football League following an opening day victory against Middlesbrough. The likes of Lincoln, Crewe and Newcastle were all dispatched with ease as John McKenna and William Barclay's side created an eight-point gap over Small Heath at the top of the Second Division. The highlight of the campaign came in October with a 6-0 victory over 'Boro in front of 6,000 supporters at Anfield.\r\n"
    },
    {
        "year": "1896",
        "flag": "left",
        "title": "Reds achieve record victory",
        "text": "Promotion-chasing Liverpool banked a record league win with a 10-1 romp over Rotherham which had Anfield purring. The Reds were on song right from the off, with skipper Jimmy Ross skimming the woodwork during the opening exchanges. It was Malcolm McVean who opened the scoring in front of 2,000 spectators – he'd go on to bag a hat-trick. The result was beyond doubt within eight minutes, with a three-goal deficit already established.\r\n"
    }
]